---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexBuffer
source: html/5f58dbef-1781-b43c-39af-bcc68de4c7ce.htm
---
# VertexBuffer Properties

Specifies whether the .NET object represents a valid Revit entity.